# Summer Analytics 2021 - Basic Data Analysis

- ####  Welcome to your first assignment, on basic data analysis!
- #### This Assignment is ungraded



### 1) Import Pandas

In [35]:
import pandas as pd

### 2) Import the dataset and  Assign it to a variable called users and use the 'user_id' as index

#### Import the dataset from this url (https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

In [36]:
users=pd.read_csv("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user",delimiter='|')
users= users.set_index('user_id')

### 3) Display the first 25 entries

In [37]:
users[:25]

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

### 4) Display the last 10 entries

In [38]:
users[-10:]

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

### 5) What is the number of observations in the dataset?

In [43]:
users.shape[0]

943

### 6) What is the number of columns in the dataset, also print the name of all the columns?

In [47]:
users.shape[1]
for col in users.columns:
    print(col)

age
gender
occupation
zip_code

### 7) What is the data type of each column?

In [53]:
users.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

### 8) Print only the occupation column

In [54]:
users.occupation

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

### 9) How many different occupations are in this dataset?

In [61]:
occ=set()
for i in users.occupation:
  occ.add(i)
c=0
for j in occ:
  c=c+1
print(c)

21

### 10) What is the most frequent occupation?

In [63]:
users.occupation.mode()

0    student
dtype: object

### 11) Summarize the DataFrame.

### 12) Summarize only the occupation column

In [64]:
occ

{'administrator',
 'artist',
 'doctor',
 'educator',
 'engineer',
 'entertainment',
 'executive',
 'healthcare',
 'homemaker',
 'lawyer',
 'librarian',
 'marketing',
 'none',
 'other',
 'programmer',
 'retired',
 'salesman',
 'scientist',
 'student',
 'technician',
 'writer'}

### 13) What is the mean age of users?

In [66]:
c=0
s=0
for i in users.age:
  c=c+1
  s=s+i
print(s/c)

34.05196182396607

### 14) What is the age with least occurrence?

In [84]:
ag=set()
for i in users.age:
  ag.add(i)
c=0
for j in ag:
  c=c+1
print(c)

k=list(ag)
print(k)
t=[0]*61

for i in k:
  for j in users.age:
    if i==j:
      t[k.index(i)]=t[k.index(i)]+1
    


x=min(t)
p=[]
c=0
for i in t:
  if i==x:
    p.append(k[c])
  c=c+1


print(p)

61
[7, 10, 11, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 68, 69, 70, 73]
[7, 10, 11, 66, 73]